## Chapter16: Handling Missing Data

---
* Author:  [Yuttapong Mahasittiwat](mailto:khala1391@gmail.com)
* Technologist | Data Modeler | Data Analyst
* [YouTube](https://www.youtube.com/khala1391)
* [LinkedIn](https://www.linkedin.com/in/yuttapong-m/)
---

Source: [**Python Data Science Handbook** by **VanderPlas**](https://jakevdp.github.io/PythonDataScienceHandbook/)

In [17]:
import numpy as np
import pandas as pd
print("numpy version :",np.__version__)
print("pandas version :",pd.__version__)

numpy version : 1.26.4
pandas version : 2.2.1

## Trade-offs in Missing Data Conventions

## Missing Data in Pandas

### None as a Sentinel Value

In [48]:
vals1 =  np.array([1,None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [50]:
 %timeit np.arange(1E6, dtype=int).sum()

2.7 ms ± 117 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [52]:
 %timeit np.arange(1E6, dtype=object).sum()

89.2 ms ± 3.94 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [54]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

### NaN: Missing Numerical Data

In [76]:
vals2 =  np.array([1,np.nan, 3, 4])
vals2

array([ 1., nan,  3.,  4.])

In [78]:
vals2.sum(), np.nansum(vals2)

(nan, 8.0)

In [80]:
1 + np.nan

nan

In [82]:
0 * np.nan

nan

In [84]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [86]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

### NaN and None in Pandas

In [88]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [100]:
x =pd.Series(range(2))
x

0    0
1    1
dtype: int64

In [104]:
x[0]=None   # upcast to floating-point type
x

0    NaN
1    1.0
dtype: float64

## Pandas Nullable Dtypes

In [106]:
pd.Series([1, np.nan, 2, None, pd.NA], dtype='Int32')

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [108]:
pd.Series([1, np.nan, 2, None, pd.NA])

0       1
1     NaN
2       2
3    None
4    <NA>
dtype: object

## Operating on Null Values

- isnull
- notnull
- dropna
- fillna

### Detecting Null Values

In [121]:
df = pd.Series([1, np.nan, 'hello', None])

In [123]:
df.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [125]:
df.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [127]:
df[df.notnull()]

0        1
2    hello
dtype: object

### Dropping Null Values

In [129]:
df.dropna()   # series , always drop row

0        1
2    hello
dtype: object

In [19]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])

In [21]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [23]:
df.dropna()    # drop row with na

     0    1  2
1  2.0  3.0  5

In [25]:
df.dropna(axis=1)     # drop column with na

   2
0  2
1  5
2  6

In [27]:
#drop row >>> labels
# df.drop(labels=[1])      # use word 'labels'
df.drop([1])

     0    1  2
0  1.0  NaN  2
2  NaN  4.0  6

In [29]:
#drop column >>> columns
df.drop(columns=[1])

     0  2
0  1.0  2
1  2.0  5
2  NaN  6

In [31]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [33]:
df.dropna(axis=1,how='all') #drop for column with all in null

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [35]:
df.dropna(thresh=3)  # treshold for notnull

     0    1  2   3
1  2.0  3.0  5 NaN

### Filling Null Values

In [38]:
data = pd.Series([1,np.nan, 2, None, 3],
              index=list('abcde'),
              dtype='Int32')   # force type 'Int32', not 'int32'
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [40]:
data.fillna(value=0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [42]:
data = pd.Series([1,np.nan, 2, None, 3],
              index=list('abcde'))      # not forced, dtype = 'float64'
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [44]:
# df.fillna(0)
data.fillna(value=0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [46]:
# df.fillna(method='ffill')  # depreciated in future
data.ffill()

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [48]:
data.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [60]:
# df.fillna(method='ffill',axis=1)
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0